//IBMUSERB JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M,TIME=1440
//JAGT     EXEC PGM=BPXBATCH,REGION=0M
//STDPARM  DD *
SH /u/ibmuser/jenkinsStart.sh 
//STDOUT   DD SYSOUT=*,RECFM=FB,LRECL=255
//STDERR   DD SYSOUT=*,RECFM=FB,LRECL=255
