//IBMUSERJ JOB CLASS=A,MSGCLASS=H,MSGLEVEL=(1,1),REGION=0M
//DEMO     EXEC PGM=ASAMPLE
//* Chg "IBMUSER.VSCODE" in the steplib DSN to match your DBB HLQ 
//*STEPLIB  DD  DISP=SHR,DSN=IBMUSER.JENKINS.LOAD   
//STEPLIB  DD  DISP=SHR,DSN=IBMUSER.VSCODE.LOAD   
//SYSOUT   DD SYSOUT=*
