       01 WS-VER    PIC X(24) VALUE 'demo v3'.
       01  WS-PARAMETERS.
           05  WS-MSG1        PIC X(30) VALUE 'Default values'.
           05  WS-RULE        PIC 9(4)  VALUE 0.
           05  WS-RESULT      PIC 9(4)  VALUE 0.