       ID DIVISION.           
       PROGRAM-ID. ASAMPLE.                                           
       ENVIRONMENT DIVISION.                                          
       DATA DIVISION.                                                 
       WORKING-STORAGE SECTION.   
       COPY VARS.                                           
       PROCEDURE DIVISION.                                            
           DISPLAY 'asample: test v2'.
           STOP RUN.