       ID DIVISION.                                                     
       PROGRAM-ID. SAMPLE.                                              
       ENVIRONMENT DIVISION.                                            
       DATA DIVISION.
       WORKING-STORAGE SECTION. 
      * COPY data.                                                  
                                                                        
       PROCEDURE DIVISION. 
           DISPLAY 'SAMPLE Hello '.                   
           STOP RUN. 
                        
       